
### Plan output
```
    azurerm_storage_account.blog: Refreshing state... [id=/subscriptions/23691100-0922-492f-893d-742cbbe0d3f5/resourceGroups/an0rak.dev/providers/Microsoft.Storage/storageAccounts/an0rakblog]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cdn_endpoint.blog_endpoint will be created
  + resource "azurerm_cdn_endpoint" "blog_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_http_allowed               = true
      + is_https_allowed              = true
      + location                      = "westeurope"
      + name                          = "CDN Endpoint"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "blogCdn"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "an0rak.dev"

      + origin {
          + host_name  = "an0rakblog.blob.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "blog"
        }
    }

  # azurerm_cdn_endpoint_custom_domain.blog_custom_endpoint will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "blog_custom_endpoint" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "an0rak.dev"
      + id              = (known after apply)
      + name            = "Custom-endpoint"
    }

  # azurerm_cdn_profile.blog_cdn will be created
  + resource "azurerm_cdn_profile" "blog_cdn" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "blogCdn"
      + resource_group_name = "an0rak.dev"
      + sku                 = "Standard_Microsoft"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + CDN_Endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
